app/Models/FileModel.php

SELECT SUM(size) as totalSize
FROM `archivos`
WHERE `id_usuario` = '0'
---
    function uploadFile($archivo, $filecode, $type, $route, $name, $id)
    {
        //var_dump($archivo->getSize());die();

        $today = date('Y-m-d', strtotime('today'));

        $data = [

            'filecode'  => $filecode,
            'ruta_local'  =>  $route . $filecode . "." . $type,
            'id_usuario'  => session()->get('id_usuario'),
            'nombre_archivo'  => $name,
            'size'  => $archivo->getSize(),
            'type'  => $type,
            'fecha_subida'  => $today,
            'fecha_borrado'  => NULL,

        ];