app/Models/PlanesModel.php

    function getPlanes()
    {

        return $this->select("*")->get()->getResultArray();
---
SELECT *
FROM `planes`