app/Models/UsuarioSistemaModel.php

    function login($post)
    {

        $result = $this->select("*")->where("email", $post['email'])->get()->getResultArray();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'test@test.com'

    function getUsuario($id)
    {
        $result = $this->select("*")->where("id_usuario", $id)->get()->getResultArray();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '18'